<?php

require_once 'mysql/Db.php';
$db = new Db('beibei');
$phase = ['小学', '初中', '高中', '大学'];
$version = [
    1 => ['冀教版', '深圳朗文', '人教版', '新标准', '深港版', '广州版', '北师大版', '小学综合英语', '新交际', '牛津小学', '广州小学', '陕旅版'],
    3 => ['人教版', '外研版', '重庆版', '冀教版', '岳麓版', '华师版', '北师大版'],
    4 => ['新视界大学英语', '北京外国语大学出版社'],
    2 => ['冀教版', '外研英语', '人教版新课标', '北大师版', '牛津版', '仁爱版', '沪教版',
        '北京课改版', '沪教牛津版', '牛津广州版', '牛津深圳版', '牛津沈阳版', '新世纪版', '剑桥青少版', '展望未来'],
];
$grade = ['大一上', '大一下', '大二上', '大二下', '大三上', '大三下','大四上','大四下'];
$unit = ['unit1', 'unit2', 'unit3', 'unit4', 'unit5', 'unit6', 'unit7', 'unit8'];

for ($i=1;$i<293;$i++) {
    foreach ($unit as $u) {
        $sql = sprintf("insert into unit (name,grade_id) values ('%s','%d')", $u,$i);
//        var_dump($sql);die;
        $db->query($sql);
    }
}